correction/s5/j4/sebastien/ancient-thicket-43098/app/views/user/show.html.erb

<center> <h1>Bienvenue <%= @gossips.user.first_name %> </h1>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]