formation/s5/j4/app_jeudi/app/views/gossips/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
	  <div class="row">
	    <div class="col-lg-2"><%= link_to gossip.user.first_name, user_path(gossip.user) %></div>