formation/s5/j4/app_jeudi/app/views/gossips/show.html.erb

	<tr><td><b>Last Name : &nbsp;</b></td><td><%= @user.last_name %></td></tr>
	<tr><td><b>City : &nbsp;</b></td><td><%= link_to City.find(@user.city_id).name, city_path(@user.city_id) %></td></tr>
---
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]

		<% @liscom.each do |uncom| %>
			<tr><td><b><%= uncom.user.first_name %> &nbsp;</b></td><td><%= uncom.content %></td></tr>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]