correction/s5/j4/sebastien/ancient-thicket-43098/app/views/index/welcomepage.html.erb

    <h2 class="card-title">"<%= gossip.title %>"</h2>
    <h4 class="card-text"><I>Ecrit par : <%= gossip.user.first_name %></I> </h4>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]