correction/s6/j3/maxime/app/controllers/attendances_controller.rb

SELECT "attendances".* FROM "attendances"
---
  def index

    @attendances = Attendance.all

SELECT "events".* FROM "events"
INSERT INTO "attendances" ("attendee_id", "event_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["attendee_id", 12], ["event_id", 4], ["created_at", "2019-02-13 23:59:59.674623"], ["updated_at", "2019-02-13 23:59:59.674623"]]
---
  def create

    @attendance = Attendance.new(attendee_id: current_user.id, event_id: Event.all.sample.id)
    @attendance.save