correction/s6/j3/maxime/app/controllers/events_controller.rb

INSERT INTO "events" ("start_date", "duration", "title", "description", "price", "location", "admin_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @event = Event.new(event_params)

    respond_to do |format|
      if @event.save