correction/s6/j3/maxime/app/controllers/home_controller.rb

SELECT "events".* FROM "events"
---
  def index
    @event = Event.all