correction/s5/j4/sebastien/ancient-thicket-43098/app/views/gossip/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---

<p> By <%= link_to @gossips.user.first_name, controller: "user", action:"show", id: @gossips.id %> </p>