formation/s5/j2/app_mardi/app/views/gossips/index.html.erb

	  <div class="row">
	    <div class="col-lg-2"><%= link_to gossip.user.first_name, user_path(gossip.user) %></div>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]