formation/s5/j3/app_mercredi/app/views/users/show.html.erb

	<tr><td><b>Age : &nbsp;</b></td><td><%= @user.age %></td></tr>
	<tr><td><b>City : &nbsp;</b></td><td><%= link_to City.find(@user.city_id).name, city_path(@user.city_id) %></td></tr>
---
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]