formation/s5/j2/app_mardi/app/views/pages/home.html.erb

	<tr valign="top">
		<td><%= link_to gossip.user.first_name , ("/user/"+gossip.user_id.to_s) %></td>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]