correction/s5/j4/sebastien/ancient-thicket-43098/app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
	def logged_in?
		current_user ||= User.find_by(id: session[:user_id]) if session[:user_id]