correction/s5/j4/sebastien/ancient-thicket-43098/app/controllers/gossip_controller.rb

 def show

     @num = params[:id]
     @gossips = Gossip.find(@num)
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

 def create
 gossip = Gossip.create(title:params[:title], description:params[:description], user_id: session[:user_id])
---
INSERT INTO "gossips" ("user_id", "title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["title", "dsad"], ["description", "dasdas"], ["created_at", "2019-02-06 14:44:40.777736"], ["updated_at", "2019-02-06 14:44:40.777736"]]

 def edit

  @gossips = Gossip.find(params[:id])
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

 def update

    @gossips = Gossip.find(params[:id])
    @gossips.update(gossip_params)
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "gossips" SET "title" = $1, "description" = $2, "updated_at" = $3 WHERE "gossips"."id" = $4  [["title", "Bespind"], ["description", "El jaya kulpa intick kuny ku suwa. (If you give it to me, I might forget I found you.)d"], ["updated_at", "2019-02-07 20:19:06.585426"], ["id", 2]]

 def destroy

  @gossips = Gossip.find(params[:id])
   @gossips.destroy
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
DELETE FROM "gossips" WHERE "gossips"."id" = $1  [["id", 8]]