correction/s5/j4/sebastien/ancient-thicket-43098/app/controllers/index_controller.rb

SELECT "gossips".* FROM "gossips"
---
  def welcomepage
  	@gossips = Gossip.all