correction/s5/j4/sebastien/ancient-thicket-43098/app/controllers/user_controller.rb

  def show
 	num = params[:id]
  	@gossips = Gossip.find(num)
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 41], ["LIMIT", 1]]

  def create

    if City.find_by(name: "params[:city]") == nil

    puts "@@@@"*60
    @c = City.new(name:params[:city])
    @u = User.new(first_name:params[:first_name], last_name:params[:last_name], age:params[:age], email:params[:email], password:params[:psw], city_id: @c.id)
    @u.save
    puts @u.errors
    puts "@@@@"*60
    redirect_to('/')

  else

    puts "@@@@"*60
    @cc = City.find_by(name: "params[:city]")
    @u = User.new(first_name:params[:first_name], last_name:params[:last_name], age:params[:age], email:params[:email], password:params[:psw], city_id: @cc.id)
    @u.save
---
SELECT  "cities".* FROM "cities" WHERE "cities"."name" = $1 LIMIT $2  [["name", "params[:city]"], ["LIMIT", 1]]
INSERT INTO "users" ("city_id", "first_name", "last_name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"