formation/s5/j3/app_mercredi/app/views/pages/gossip.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
<table>
	<tr><td><b>First Name : &nbsp;</b></td><td><%= @gossip.user.first_name %></td></tr>