formation/s5/j4/app_jeudi/app/controllers/comments_controller.rb

  def create
    @gossip = Gossip.find(params[:gossip_id])
    @comment = @gossip.comments.create(comment_params)
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("content", "user_id", "gossip_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "dernier essai avant explosion !!!"], ["user_id", 1], ["gossip_id", 3], ["created_at", "2019-02-07 01:16:33.644395"], ["updated_at", "2019-02-07 01:16:33.644395"]]