formation/s5/j4/app_jeudi/app/controllers/gossips_controller.rb

SELECT "gossips".* FROM "gossips"
---
  def index
    @login=false; @login=true if session[:user_id]
  	@gossips = Gossip.all

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."gossip_id" = $1  [["gossip_id", 21]]
---
  def show
    @login=false; @login=true if session[:user_id]
    @gossip  = Gossip.find(params[:id])
    @user    = User.find(@gossip.user_id)
    @comment = Comment.new
    @liscom  = Comment.where(gossip_id: params[:id])

INSERT INTO "gossips" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "La bite de Quentin"], ["content", "Elle est vraiment très très grosse"], ["user_id", 1], ["created_at", "2019-02-06 15:24:39.100645"], ["updated_at", "2019-02-06 15:24:39.100645"]]
---
  def create
    @gossip = Gossip.new(gossip_params)
    if @gossip.save

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 26], ["LIMIT", 1]]
---
  def edit
    verif_login
    @gossip = Gossip.find(params[:id])

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 26], ["LIMIT", 1]]
UPDATE "gossips" SET "title" = $1, "user_id" = $2, "updated_at" = $3 WHERE "gossips"."id" = $4  [["title", "test yann"], ["user_id", 1], ["updated_at", "2019-02-06 16:30:38.925566"], ["id", 2]]
---
  def update
    @gossip = Gossip.find(params[:id])
    if @gossip.update(gossip_params)

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "gossips" WHERE "gossips"."id" = $1  [["id", 1]]
---
  def destroy
    verif_login
    @gossip = Gossip.find(params[:id])
    @gossip.destroy