formation/s5/j4/app_jeudi/app/controllers/users_controller.rb

  def new
  	@user   = User.new
    @lisvil = City.all
---
SELECT "cities".* FROM "cities"

  def create
  	@user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("first_name", "last_name", "email", "age", "city_id", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"